case_cylinder_kOmegaFine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          2624;
        startFace       1496882;
    }
    outlet
    {
        type            patch;
        nFaces          2624;
        startFace       1499506;
    }
    roughCylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5120;
        startFace       1502130;
    }
    sideWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8128;
        startFace       1507250;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          15854;
        startFace       1515378;
    }
    top
    {
        type            patch;
        nFaces          15854;
        startFace       1531232;
    }
)

// ************************************************************************* //
