case_cylinder_kOmegaFine/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Ubar            [0 1 -1 0 0 0 0] (0.39 0 0);

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1.0e-06;
rho             rho [ 1 -3 0 0 0 0 0 ] 1000.0;

// ************************************************************************* //
