case_cylinder_kOmegaFine/0.default/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];		// [kg m s X X X X] 

internalField   uniform 0;			
boundaryField					
{
    inlet		// will be over-written when mapping the fields
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    roughCylinder
    {
          type          zeroGradient;
    }

    bottom
    {
          type          zeroGradient;
    }
		
    top
    {
          type          slip;
    }

    sideWall
    {
          type          zeroGradient;
    }
}

// ************************************************************************* //
