case_cylinder_kOmegaFine/0.default/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.00;

boundaryField
{
    inlet		// will be overwritten when mapping is performed
    {
        type            fixedValue;
        value           uniform 99999;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            slip;
    }


    bottom
    {
        type            omegaWallFunction;		// wall function (!)
        value           uniform 0;
    }

    roughCylinder
    {
        type            omegaWallFunction;		// wall function (!)
        value           uniform 0;
    }

    sideWall
    {
        type            omegaWallFunction;		// wall function (!)
        value           uniform 0;
    }

    
}


// ************************************************************************* //
